{"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"kernel_regularizer": null, "activation": "linear", "trainable": true, "name": "dense_1", "units": 3, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "use_bias": true, "bias_constraint": null, "batch_input_shape": [null, 7], "kernel_constraint": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activation": "relu", "trainable": true, "name": "dense_2", "units": 6, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activation": "linear", "trainable": true, "name": "dense_3", "units": 3, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null}}], "backend": "tensorflow", "keras_version": "2.0.2"}