{"keras_version": "2.0.2", "backend": "tensorflow", "config": [{"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "name": "dense_1", "use_bias": true, "units": 3, "batch_input_shape": [null, 7], "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "dtype": "float32"}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "name": "dense_2", "use_bias": true, "units": 6, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu"}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "name": "dense_3", "use_bias": true, "units": 3, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear"}, "class_name": "Dense"}], "class_name": "Sequential"}